plerup/easy_nrf52/src/lib/enrf.c
//--------------------------------------------------------------------------

static void nrf_qwr_error_handler(uint32_t nrf_error) {
  APP_ERROR_HANDLER(nrf_error);
}

//--------------------------------------------------------------------------

#define EQ_STR(s1, s2) (strcasestr(s1, s2) == s1)

static void nus_data_handler(ble_nus_evt_t *p_evt) {
  if (p_evt->type == BLE_NUS_EVT_RX_DATA) {
    if (m_app_nus_rec_cb && m_app_nus_rec_cb((uint8_t *)p_evt->params.rx_data.p_data, p_evt->params.rx_data.length))
      return;
    // Check for possible standard requests
    char str[BLE_NUS_MAX_DATA_LEN + 1];
    strlcpy(str, (const char*)p_evt->params.rx_data.p_data, MIN(sizeof(str), p_evt->params.rx_data.length+1));
    if (str[0] && str[strlen(str) - 1] == '\n')
      str[strlen(str) - 1] = 0;
    if (EQ_STR(str, "version?")) {
      char ver[80];
      snprintf(ver, sizeof(ver), "%s %s", _build_version, _build_time);
      enrf_nus_string_send(ver);
    } else if (EQ_STR(str, "mac?")) {
      enrf_nus_string_send(enrf_get_device_address());
    } else if (EQ_STR(str, "restart")) {
      m_restart = 1;
      enrf_nus_string_send("Restarting");
    } else if (EQ_STR(str, "dfu")) {
      m_restart = 2;
      enrf_nus_string_send("Entering DFU");
    } else {
      enrf_nus_string_send("* Unrecognized nus data");
    }
  }
}

//--------------------------------------------------------------------------

static void services_init(void) {
  uint32_t err_code;
  nrf_ble_qwr_init_t qwr_init = {0};
  qwr_init.error_handler = nrf_qwr_error_handler;
  err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
  APP_ERROR_CHECK(err_code);

  ble_nus_init_t nus_init;
  memset(&nus_init, 0, sizeof(nus_init));
  nus_init.data_handler = nus_data_handler;
  err_code = ble_nus_init(&m_nus, &nus_init);
  APP_ERROR_CHECK(err_code);

#if BLE_DFU_ENABLED == 1
  ble_dfu_buttonless_init_t dfus_init = {0};
  dfus_init.evt_handler = ble_dfu_evt_handler;
  err_code = ble_dfu_buttonless_init(&dfus_init);
  APP_ERROR_CHECK(err_code);
#endif
}

//--------------------------------------------------------------------------

static void on_conn_params_evt(ble_conn_params_evt_t *p_evt) {
  uint32_t err_code;
  if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    APP_ERROR_CHECK(err_code);
  }
}

//--------------------------------------------------------------------------

static void conn_params_error_handler(uint32_t nrf_error) {
  APP_ERROR_HANDLER(nrf_error);
}

//--------------------------------------------------------------------------

static void conn_params_init(void) {
  uint32_t err_code;
  ble_conn_params_init_t cp_init;
  memset(&cp_init, 0, sizeof(cp_init));
  cp_init.p_conn_params = NULL;
  cp_init.first_conn_params_update_delay = APP_TIMER_TICKS(5000);
  cp_init.next_conn_params_update_delay = APP_TIMER_TICKS(30000);
  cp_init.max_conn_params_update_count = 3;
  cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail = false;
  cp_init.evt_handler = on_conn_params_evt;
  cp_init.error_handler = conn_params_error_handler;
  err_code = ble_conn_params_init(&cp_init);
  APP_ERROR_CHECK(err_code);
}

//--------------------------------------------------------------------------

static void ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context) {
  uint32_t err_code;

  switch (p_ble_evt->header.evt_id) {
    case BLE_GAP_EVT_CONNECTED:
      NRF_LOG_DEBUG("Connected");
      m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
      err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
      APP_ERROR_CHECK(err_code);
      if (m_is_central) {
        memset(&m_ble_db_discovery, 0, sizeof(m_ble_db_discovery));
        ble_db_discovery_start(&m_ble_db_discovery, p_ble_evt->evt.gap_evt.conn_handle);
      }
      break;

    case BLE_GAP_EVT_DISCONNECTED:
      NRF_LOG_DEBUG("Disconnected: reason 0x%x.", p_ble_evt->evt.gap_evt.params.disconnected.reason);
      m_conn_handle = BLE_CONN_HANDLE_INVALID;
      if (m_is_advertising)
        sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
      m_is_central = false;
      break;

    case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
      NRF_LOG_DEBUG("PHY update request.");
      ble_gap_phys_t const phys =
      {
        .rx_phys = BLE_GAP_PHY_AUTO,
        .tx_phys = BLE_GAP_PHY_AUTO,
      };
      err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
      APP_ERROR_CHECK(err_code);
    } break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
      // Pairing not supported
      err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
      APP_ERROR_CHECK(err_code);
      break;

    case BLE_GAP_EVT_ADV_REPORT: {
      ble_evt_t *p = (ble_evt_t *)p_ble_evt;
      ble_gap_evt_t *p_gap_evt = &p->evt.gap_evt;
      if (!m_adv_report_cb || !m_adv_report_cb(&p_gap_evt->params.adv_report))
        if (sd_ble_gap_scan_start(NULL, &m_adv_rep_buffer) != NRF_SUCCESS)
          NRF_LOG_ERROR("Failed to restart scanning");
      break;
    }

    case BLE_GAP_EVT_TIMEOUT: {
      const ble_gap_evt_t *p_gap_evt = &p_ble_evt->evt.gap_evt;
      if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
        NRF_LOG_ERROR("Scan timed out");
      } else if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
        NRF_LOG_ERROR("Connection Request timed out");
      }
      break;
    }

    case BLE_GATTS_EVT_SYS_ATTR_MISSING:
      // No system attributes have been stored.
      err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
      APP_ERROR_CHECK(err_code);
      break;

    case BLE_GATTC_EVT_TIMEOUT:
      // Disconnect on GATT Client timeout event.
      err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                       BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
      APP_ERROR_CHECK(err_code);
      break;

    case BLE_GATTS_EVT_TIMEOUT:
      // Disconnect on GATT Server timeout event.
      err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                       BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
      APP_ERROR_CHECK(err_code);
      break;

    case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
      m_gatt_max_length = p_ble_evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets;
      break;

    default:
      break;
  }

  if (m_is_central)
    ble_db_discovery_on_ble_evt(p_ble_evt, &m_ble_db_discovery);

  if (m_app_evt_cb)
    m_app_evt_cb(p_ble_evt, p_context);
}

