plerup/easy_nrf52/src/lib/enrf.c
//--------------------------------------------------------------------------

ret_code_t enrf_stop_advertise() {
  m_is_advertising = false;
  return sd_ble_gap_adv_stop(m_adv_handle);
}

//--------------------------------------------------------------------------

bool enrf_is_connected() {
  return m_conn_handle != BLE_CONN_HANDLE_INVALID;
}

//--------------------------------------------------------------------------

ret_code_t enrf_nus_data_send(const uint8_t *data, uint32_t length) {
  ret_code_t err_code = NRF_SUCCESS;
  while (length) {
    uint16_t curr = MIN(m_ble_nus_max_data_len, length);
    do {
      err_code = ble_nus_data_send(&m_nus, (uint8_t*)data, &curr, m_conn_handle);
    } while (err_code == NRF_ERROR_RESOURCES);
    length -= curr;
    data += curr;
  }
  return err_code;
}

//--------------------------------------------------------------------------

ret_code_t enrf_nus_string_send(const char *str) {
  return enrf_nus_data_send((uint8_t *)str, strlen(str) + 1);
}

//--------------------------------------------------------------------------

void enrf_set_scan_par(uint16_t scan_int, uint16_t scan_wind) {
  m_scan_params.interval = scan_int;
  m_scan_params.window = scan_wind;
}

//--------------------------------------------------------------------------

ret_code_t enrf_start_scan(scan_report_cb_t report_cb, uint32_t timeout_s, bool active) {
  sd_ble_gap_scan_stop();
  m_scan_params.active = active ? 1 : 0;
  m_scan_params.extended = m_long_range ? 1 : 0;
  m_scan_params.timeout = timeout_s*100;
  m_scan_params.scan_phys = m_long_range ? BLE_GAP_PHY_CODED : BLE_GAP_PHY_AUTO;
  m_scan_params.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
  sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, 0, m_tx_power);
  m_adv_report_cb = report_cb;
  return sd_ble_gap_scan_start(&m_scan_params, &m_adv_rep_buffer);
}

//--------------------------------------------------------------------------

ret_code_t enrf_stop_scan() {
  return sd_ble_gap_scan_stop();
}

//--------------------------------------------------------------------------

uint8_t enrf_adv_parse(ble_gap_evt_adv_report_t *p_adv_report,
                       uint8_t start_tag, uint8_t end_tag,
                       uint8_t *dest, uint8_t dest_len) {
  size_t offset;
  offset = 0;
  while (offset < p_adv_report->data.len) {
    uint8_t field_len = p_adv_report->data.p_data[offset];
    uint8_t field_type = p_adv_report->data.p_data[offset + 1];

    if (offset + field_len > p_adv_report->data.len)
      return 0;

    if (field_type >= start_tag && field_type <= end_tag) {
      uint8_t len = field_len - 1;
      if (len > dest_len)
        return 0;
      memcpy(dest, &(p_adv_report->data.p_data[offset + 2]), len);
      return len;
    }
    offset += field_len + 1;
  }
  return 0;
}

//--------------------------------------------------------------------------

ret_code_t enrf_disconnect() {
  return sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

//--------------------------------------------------------------------------

void enrf_set_connection_params(float min_con_int_ms, float max_con_int_ms, uint16_t slave_latency, float sup_timeout_ms) {
  m_connection_param.min_conn_interval = MSEC_TO_UNITS(min_con_int_ms, UNIT_1_25_MS);
  m_connection_param.max_conn_interval = MSEC_TO_UNITS(max_con_int_ms, UNIT_1_25_MS);
  m_connection_param.slave_latency = slave_latency;
  m_connection_param.conn_sup_timeout = MSEC_TO_UNITS(sup_timeout_ms, UNIT_10_MS);
}

//--------------------------------------------------------------------------

static void ble_nus_c_evt_handler(ble_nus_c_t *p_ble_nus_c, const ble_nus_c_evt_t *p_ble_nus_evt) {
  uint32_t err_code;
  switch (p_ble_nus_evt->evt_type) {
    case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
      // UART service detected
      err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
      APP_ERROR_CHECK(err_code);
      err_code = ble_nus_c_tx_notif_enable(p_ble_nus_c);
      APP_ERROR_CHECK(err_code);
      if (m_nus_c_rx_cb)
        m_nus_c_rx_cb(NULL, 1);
      break;

    case BLE_NUS_C_EVT_NUS_TX_EVT:
      // UART response received
      if (m_nus_c_rx_cb)
        m_nus_c_rx_cb(p_ble_nus_evt->p_data, p_ble_nus_evt->data_len);
      break;

    case BLE_NUS_C_EVT_DISCONNECTED:
      if (m_nus_c_rx_cb)
        m_nus_c_rx_cb(NULL, 0);
      break;
  }
}

//--------------------------------------------------------------------------

ret_code_t enrf_connect_to(ble_gap_addr_t *addr, db_disc_cb_t disc_cb, nus_c_rx_cb_t nus_c_rx_cb) {
  static bool nus_init = false;
  m_disc_cb = disc_cb;
  m_nus_c_rx_cb = nus_c_rx_cb;
  if (nus_c_rx_cb && !nus_init) {
    ble_nus_c_init_t nus_c_init_t;
    nus_c_init_t.evt_handler = ble_nus_c_evt_handler;
    APP_ERROR_CHECK(ble_nus_c_init(&m_ble_nus_c, &nus_c_init_t));
    nus_init = true;
  }
  m_is_central = true;
  return sd_ble_gap_connect(addr, &m_scan_params, &m_connection_param, APP_BLE_CONN_CFG_TAG);
}

//--------------------------------------------------------------------------

ret_code_t enrf_enable_char_notif(uint16_t cccd_handle, bool enable) {
  uint8_t buf[BLE_CCCD_VALUE_LEN];
  buf[0] = enable ? BLE_GATT_HVX_NOTIFICATION : 0;
  buf[1] = 0;
  const ble_gattc_write_params_t write_params = {
      .write_op = BLE_GATT_OP_WRITE_REQ,
      .flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
      .handle = cccd_handle,
      .offset = 0,
      .len = sizeof(buf),
      .p_value = buf};
  return sd_ble_gattc_write(m_conn_handle, &write_params);
}

//--------------------------------------------------------------------------

ret_code_t enrf_write_char(uint8_t op, uint16_t char_handle, uint8_t *data, uint16_t length) {
  const ble_gattc_write_params_t write_params = {
      .write_op = op,
      .flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
      .handle = char_handle,
      .offset = 0,
      .len = length,
      .p_value = data};
  return sd_ble_gattc_write(m_conn_handle, &write_params);
}

