plerup/easy_nrf52/src/lib/enrf.c
//--------------------------------------------------------------------------

ret_code_t enrf_read_char(uint16_t char_handle) {
  return sd_ble_gattc_read(m_conn_handle, char_handle, 0);
}

//--------------------------------------------------------------------------

ret_code_t enrf_nus_c_data_send(const uint8_t *data, uint32_t length) {
  return ble_nus_c_string_send(&m_ble_nus_c, (uint8_t *)data, length);
}

//--------------------------------------------------------------------------

ret_code_t enrf_nus_c_string_send(const char *str) {
  return enrf_nus_c_data_send((const uint8_t *)str, strlen(str));
}

//--------------------------------------------------------------------------

void enrf_wait_for_event() {
#ifdef ENRF_SERIAL_USB
  while (app_usbd_event_queue_process());
#endif
  if (m_restart)
    enrf_restart(m_restart == 2);
  if (NRF_LOG_PROCESS() == false) {
    nrf_pwr_mgmt_run();
  }
}

//--------------------------------------------------------------------------

void enrf_restart(bool enter_dfu) {
  NRF_LOG_INFO("Restarting: %d", enter_dfu);
  if (enter_dfu) {
    sd_power_gpregret_clr(0, 0xffffffff);
    sd_power_gpregret_set(0, 0xB1);
  }
  if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
    sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
  }
  NRF_LOG_PROCESS();
  nrf_delay_ms(1000);
  NVIC_SystemReset();
}

//--------------------------------------------------------------------------

ret_code_t enrf_add_uuid(const char *uuid) {
  ret_code_t res;
  ble_uuid128_t base_uuid;
  ble_uuid_t service_uuid;
  const char *s = uuid;
  int ind = 15;
  bool ok = true;
  // Read base uuid hex values, big endian
  while (ok && *s != 0 && *s != ',') {
    if (*s == '-') {
      // Uuid field separator
      s++;
      continue;
    }
    unsigned int b;
    ok = sscanf(s, "%02X", &b) == 1;
    *(base_uuid.uuid128 + (ind--)) = b;
    s += 2;
  }
  ok = ok && ind == -1 && s != NULL;
  if (ok) {
    res = sd_ble_uuid_vs_add(&base_uuid, &service_uuid.type);
    if (res == NRF_SUCCESS) {
      // Service uuid
      service_uuid.uuid = *((uint16_t *)&base_uuid.uuid128 + 6);
      if (service_uuid.uuid)
        res = ble_db_discovery_evt_register(&service_uuid);
    }
  } else {
    res = NRF_ERROR_INVALID_PARAM;
    NRF_LOG_ERROR("Invalid UUID");
  }
  return res;
}

//--------------------------------------------------------------------------

const char *enrf_addr_to_str(ble_gap_addr_t *gap_addr) {
  static char addr[18];
  addr[0] = 0;
  snprintf(addr, sizeof(addr),
           "%02X:%02X:%02X:%02X:%02X:%02X",
           gap_addr->addr[5],
           gap_addr->addr[4],
           gap_addr->addr[3],
           gap_addr->addr[2],
           gap_addr->addr[1],
           gap_addr->addr[0]);
  return addr;
}

//--------------------------------------------------------------------------

bool enrf_str_to_addr(const char *addr_str, ble_gap_addr_t *gap_addr) {
  int x[6];
  int cnt = sscanf(addr_str, "%X:%X:%X:%X:%X:%X", &x[5], &x[4], &x[3], &x[2], &x[1], &x[0]);
  for (int i = 0; i < cnt; i++)
    gap_addr->addr[i] = x[i];
  return cnt == 6;
}

//--------------------------------------------------------------------------

const char *enrf_get_device_address() {
  ble_gap_addr_t ble_gap_addr;
  if (sd_ble_gap_addr_get(&ble_gap_addr) == NRF_SUCCESS)
    return enrf_addr_to_str(&ble_gap_addr);
  else
    return "?";
}

//--------------------------------------------------------------------------

static inline uint8_t _hex_val(char val) {
  if (val >= '0' && val <= '9')
    return (uint8_t)(val) - '0';
  else if (val >= 'A' && val <= 'F')
    return (uint8_t)(val) - 'A' + 10;
  else if (val >= 'a' && val <= 'f')
    return (uint8_t)(val) - 'a' + 10;
  else
    return 0xFF;
}

//--------------------------------------------------------------------------

uint32_t hex_to_bytes(const char *str, uint8_t *bytes, uint32_t max_len) {
  uint32_t len = MIN(strlen(str) / 2, max_len);
  for (uint32_t i = 0; i < len; i++) {
    uint8_t val = _hex_val(*str++);
    if (val > 15) return 0;
    *bytes = val << 4;
    val = _hex_val(*str++);
    if (val > 15) return 0;
    *bytes += val;
    bytes++;
  }
  return len;
}

//--------------------------------------------------------------------------

static inline char _hex_char(uint8_t val) {
  if (val >= 0 && val <= 9)
    return '0' + val;
  else if (val >= 10 && val <= 15)
    return 'A' + val - 10;
  return 0;
}

//--------------------------------------------------------------------------

void bytes_to_hex(uint8_t *bytes, uint32_t len, char *str) {
  for (uint32_t i = 0; i < len; i++) {
    uint8_t val = bytes[i];
    *(str++) = _hex_char(val >> 4);
    *(str++) = _hex_char(val & 0xF);
  }
  *str = 0;
}

//--------------------------------------------------------------------------

#if defined(ENRF_SERIAL_USB) || defined(ENRF_SERIAL_UART)

#define READ_BUFF_SIZE 100

static bool m_input_available = false;
static size_t m_input_pos = 0;
static char m_input_buffer[READ_BUFF_SIZE];

size_t enrf_serial_read(char *str, size_t max_length) {
  if (!m_input_available) return 0;
  size_t len = MIN(max_length - 1, MAX(1, m_input_pos));
  strncpy(str, m_input_buffer, len);
  str[len] = 0;
  m_input_pos = 0;
  m_input_available = false;
  return len;
}

#endif

#ifdef ENRF_SERIAL_USB

#define CDC_ACM_COMM_INTERFACE 0
#define CDC_ACM_COMM_EPIN NRF_DRV_USBD_EPIN2

#define CDC_ACM_DATA_INTERFACE 1
#define CDC_ACM_DATA_EPIN NRF_DRV_USBD_EPIN1
#define CDC_ACM_DATA_EPOUT NRF_DRV_USBD_EPOUT1

#define READ_SIZE 1

static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const *p_inst,
                                    app_usbd_cdc_acm_user_event_t event);
static void usbd_user_ev_handler(app_usbd_event_type_t event);

APP_USBD_CDC_ACM_GLOBAL_DEF(m_app_cdc_acm,
                            cdc_acm_user_ev_handler,
                            CDC_ACM_COMM_INTERFACE,
                            CDC_ACM_DATA_INTERFACE,
                            CDC_ACM_COMM_EPIN,
                            CDC_ACM_DATA_EPIN,
                            CDC_ACM_DATA_EPOUT,
                            APP_USBD_CDC_COMM_PROTOCOL_NONE);

static const app_usbd_config_t m_usbd_config = {.ev_state_proc = usbd_user_ev_handler};

static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const *p_inst,
                                    app_usbd_cdc_acm_user_event_t event) {
  static char rx_buffer[READ_SIZE];

