plerup/easy_nrf52/src/lib/enrf.c
  switch (event) {
    case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN: {
      // Setup first transfer
      app_usbd_cdc_acm_read(&m_app_cdc_acm, rx_buffer, READ_SIZE);
      break;
    }
    case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
      break;
    case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
      break;
    case APP_USBD_CDC_ACM_USER_EVT_RX_DONE: {
      ret_code_t ret;
      do {
        if (!m_input_available && rx_buffer[0] != '\r') {
          if (rx_buffer[0] == '\n' || m_input_pos >= READ_BUFF_SIZE)
            m_input_available = true;
          else
            m_input_buffer[m_input_pos++] = rx_buffer[0];
        }
        // Fetch data until internal buffer is empty
        ret = app_usbd_cdc_acm_read(&m_app_cdc_acm, rx_buffer, READ_SIZE);
      } while (ret == NRF_SUCCESS);

      break;
    }
    default:
      break;
  }
}

//--------------------------------------------------------------------------

static void usbd_user_ev_handler(app_usbd_event_type_t event) {
  switch (event) {
    case APP_USBD_EVT_DRV_SUSPEND:
      break;
    case APP_USBD_EVT_DRV_RESUME:
      break;
    case APP_USBD_EVT_STARTED:
      break;
    case APP_USBD_EVT_STOPPED:
      app_usbd_disable();
      bsp_board_leds_off();
      break;
    case APP_USBD_EVT_POWER_DETECTED:
      NRF_LOG_INFO("USB power detected");
      if (!nrf_drv_usbd_is_enabled()) {
        app_usbd_enable();
      }
      break;
    case APP_USBD_EVT_POWER_REMOVED:
      NRF_LOG_INFO("USB power removed");
      app_usbd_stop();
      break;
    case APP_USBD_EVT_POWER_READY:
      NRF_LOG_INFO("USB ready");
      app_usbd_start();
      break;
    default:
      break;
  }
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_enable(bool on) {
  if (!on)
    return NRF_ERROR_API_NOT_IMPLEMENTED;
  ret_code_t ret;
  app_usbd_serial_num_generate();

  ret = app_usbd_init(&m_usbd_config);
  APP_ERROR_CHECK(ret);
  app_usbd_class_inst_t const *class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
  ret = app_usbd_class_append(class_cdc_acm);
  APP_ERROR_CHECK(ret);

  ret = app_usbd_power_events_enable();
  m_serial_active = true;
  return ret;
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  ret_code_t res = NRF_SUCCESS;
  if (m_serial_active) {
    for (int i = 0; i < strlen(str); i++) {
      do {
        res = app_usbd_cdc_acm_write(&m_app_cdc_acm, str + i, 1);
        app_usbd_event_queue_process();
      } while (res == NRF_ERROR_BUSY);
    }
  }
  return res;
}

//--------------------------------------------------------------------------


#elif defined(ENRF_SERIAL_UART)

#define UART_TX_BUF_SIZE 256
#define UART_RX_BUF_SIZE 256

static void uart_event_handler(app_uart_evt_t *p_event) {
  uint8_t ch;
  switch (p_event->evt_type) {
    case APP_UART_DATA_READY:
      app_uart_get(&ch);
      if (!m_input_available && ch != '\r') {
        if (ch == '\n' || m_input_pos >= READ_BUFF_SIZE)
          m_input_available = true;
        else
          m_input_buffer[m_input_pos++] = ch;
      }
      break;

    default:
      break;
  }
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_enable(bool on) {
  uint32_t err_code = NRF_SUCCESS;
  if (on != m_serial_active) {
    if (on) {
      app_uart_comm_params_t comm_params;
      comm_params.rx_pin_no = RX_PIN_NUMBER;
      comm_params.tx_pin_no = TX_PIN_NUMBER;
      comm_params.flow_control = APP_UART_FLOW_CONTROL_DISABLED;
      comm_params.use_parity = false;
      comm_params.baud_rate = UART_BAUD_RATE;

      APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_event_handler,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);
    } else {
      nrf_delay_ms(250);
      err_code = app_uart_close();
    }
    m_serial_active = on;
  }
  return err_code;
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  ret_code_t err_code = NRF_SUCCESS;
  if (m_serial_active) {
    for (size_t i = 0; i < strlen(str) && err_code == NRF_SUCCESS; i++)
      err_code = app_uart_put(str[i]);
  }

  return err_code;
}

//--------------------------------------------------------------------------


#else

ret_code_t enrf_serial_enable(bool on) {
  m_serial_active = on;
  return NRF_SUCCESS;
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  return NRF_ERROR_API_NOT_IMPLEMENTED;
}

//--------------------------------------------------------------------------

size_t enrf_serial_read(char *str, size_t max_length) {
  return 0;
}

#endif